app/controllers/disscussions_controller.rb

SELECT "disscussions".* FROM "disscussions"
---
  def index
    @disscussions = Disscussion.all

SELECT  "disscussions".* FROM "disscussions" WHERE "disscussions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @disscussion = Disscussion.find(params[:id])

INSERT INTO "disscussions" ("headline", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["headline", "Alex"], ["content", "Leybourne"], ["created_at", "2019-10-23 23:14:02.243517"], ["updated_at", "2019-10-23 23:14:02.243517"], ["user_id", 1]]
---
  def create
    @disscussion = current_user.disscussions.new(disscussion_params)

    respond_to do |format|
      if @disscussion.save

DELETE FROM "disscussions" WHERE "disscussions"."id" = $1  [["id", 2]]
---
  def destroy
    @disscussion.destroy

SELECT  "disscussions".* FROM "disscussions" WHERE "disscussions"."user_id" = $1 AND "disscussions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_owned_disscussion
      begin
        @disscussion = current_user.disscussions.find(params[:id])