app/controllers/sessions_controller.rb

    def new
        user = User.create_or_update_from(request.env['omniauth.auth'])
---
INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "1163300877341351936"], ["created_at", "2019-10-22 23:57:47.212382"], ["updated_at", "2019-10-22 23:57:47.212382"]]