app/models/user.rb

INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "1163300877341351936"], ["created_at", "2019-10-22 23:57:47.212382"], ["updated_at", "2019-10-22 23:57:47.212382"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 AND "users"."provider" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["uid", "1163300877341351936"], ["provider", "twitter"], ["LIMIT", 1]]
UPDATE "users" SET "nickname" = $1, "name" = $2, "location" = $3, "image_url" = $4, "description" = $5, "token" = $6, "secret" = $7, "updated_at" = $8 WHERE "users"."id" = $9
---
    def self.create_or_update_from(auth_info )
        user = where(uid: auth_info[:uid], provider: auth_info[:provider]).first_or_create
        user.update(
            nickname:    auth_info[:info][:nickname],
            name:        auth_info[:info][:name],
            email:       auth_info[:info][:email],
            location:    auth_info[:info][:location],
            image_url:   auth_info[:info][:image],
            description: auth_info[:info][:description],
            token:       auth_info[:credentials][:token],
            secret:      auth_info[:credentials][:secret]
        )